export const ROOM_IDS_1_FLOOR = {
  HALL_CORRIDOR: "room-1-101", // Холл Коридор  (101)
  STAIRS: "room-1-102", // Лестница  (102)
  TOILET: "room-1-103", // Туалет  (103)
  WASHROOM: "room-1-104", // Умывальня  (104)
  DRESSING_ROOM: "room-1-105", // Раздевалка  (105)
  SENIOR_ROOM: "room-1-106", // Помещение старшего смены (106)
  CHECKPOINT: "room-1-108", // Проходная (108)
  STORAGE_SOCKETS: "room-1-109", // Кладовка (109)
  EMERGENCY_LIGHTING: "room-1-111",
  VIP_DINING: "room-1-112", // Столовая VIP (112)
  FLOUR_WORKSHOP: "room-1-113", // Мучной цех (113)
  VEGETABLE_WORKSHOP: "room-1-114", // Овощной цех (114)
  HOT_WORKSHOP: "room-1-115", // Горячий цех (115)
  STAFF_ROOM: "room-1-116", // Комната для персонала (116)
  MEAT_WORKSHOP: "room-1-117", // Мясной цех (117)
  SHOWER: "room-1-118", // Душевая (118)
  DRY_PRODUCTS_STORAGE: "room-1-119", // Кладовая сухих продуктов (119)
  DINING_TOILET: "room-1-120", // Туалет столовая (120)
  REFRIGERATION: "room-1-121", // Холодильное отделение (121)
  HEAD_OFFICE: "room-1-122", // Кабинет заведующей (122)
  CLEANING_STORAGE: "room-1-123", // Кладовая уборочного инвентаря (123)
  DINING_CORRIDOR: "room-1-124", // Коридор столовая (124)
  DINING: "room-1-125", // Обеденный зал  (125)
  DINING_ROOM: "room-1-126", // Столовая зал  (126)
  BASEMENT: "room-1-127", // Подвал  (127)
} as const;

export const ELECTRICAL_POINT_IDS_1_FLOOR = {
  // Розетки
  OUT_101_1: "out-101-1",
  OUT_101_2: "out-101-2",
  OUT_101_3: "out-101-3",
  OUT_101_4: "out-101-4",
  OUT_105_1: "out-105-1",
  OUT_106_1: "out-106-1",
  OUT_108_1: "out-108-1",
  OUT_109_1: "out-109-1",

  // Столовая VIP (112)
  OUT_112_1: "out-112-1",
  OUT_112_2: "out-112-2",

  // Мучной цех (113)

  OUT_113_1: "out-113-1",

  // Овощной цех (114)

  OUT_114_1: "out-114-1",

  // Горячий цех (115)

  OUT_115_1: "out-115-1",

  // Комната для персонала (116)

  OUT_116_1: "out-116-1",

  // Мясной цех (117)

  OUT_117_1: "out-117-1",

  // Душевая (118)

  OUT_118_1: "out-118-1",

  // Кладовая сухих продуктов (119)

  OUT_119_1: "out-119-1",

  // Туалет столовая (120)

  OUT_120_1: "out-120-1",

  // Холодильное отделение (121)

  OUT_121_1: "out-121-1",

  // Кабинет заведующей (122)

  OUT_122_1: "out-122-1",

  // Кладовая уборочного инвентаря (123)

  OUT_123_1: "out-123-1",

  // Столовая  (125)

  OUT_125_1: "out-125-1",

  OUT_124_1: "out-124-1",

  // Холл Коридор  (101)
  FIX_101_1: "fix-101-1",
  FIX_101_2: "fix-101-2",
  FIX_101_3: "fix-101-3",

  // Лестница  (102)
  FIX_102_1: "fix-102-1",
  FIX_102_2: "fix-102-2",
  FIX_102_3: "fix-102-3",
  FIX_102_4: "fix-102-4",

  // Туалет  (103)
  FIX_103_1: "fix-103-1",
  FIX_103_2: "fix-103-2",

  // Умывальня  (104)
  FIX_104_1: "fix-104-1",
  FIX_104_2: "fix-104-2",
  FIX_104_3: "fix-104-3",

  // Светильники комнаты 105 (Раздевалка)
  FIX_105_1: "fix-105-1",

  // Помещение старшего смены (106)
  FIX_106_1: "fix-106-1",

  // Проходная  (108)
  FIX_108_1: "fix-108-1",
  FIX_108_2: "fix-108-2",

  // кладовка (109 )
  FIX_109_1: "fix-109-1",

  //Дежурное освещение   (111)
  FIX_111_1: "fix-111-1",
  FIX_111_2: "fix-111-2",

  // Столовая VIP (112)

  FIX_112_1: "fix-112-1",
  FIX_112_2: "fix-112-2",

  // Мучной цех (113)

  FIX_113_1: "fix-113-1",
  FIX_113_2: "fix-113-2",

  // Овощной цех (114)

  FIX_114_1: "fix-114-1",
  FIX_114_2: "fix-114-2",

  // Горячий цех (115)

  FIX_115_1: "fix-115-1",
  FIX_115_2: "fix-115-2",
  FIX_115_3: "fix-115-3",

  // Комната для персонала (116)

  FIX_116_1: "fix-116-1",

  // Мясной цех (117)

  FIX_117_1: "fix-117-1",
  FIX_117_2: "fix-117-2",

  // Душевая (118)

  FIX_118_1: "fix-118-1",

  // Кладовая сухих продуктов (119)

  FIX_119_1: "fix-119-1",

  // Туалет столовая (120)

  FIX_120_1: "fix-120-1",

  // Холодильное отделение (121)

  FIX_121_1: "fix-121-1",
  FIX_121_2: "fix-117-2",

  // Кабинет заведующей (122)

  FIX_122_1: "fix-122-1",
  FIX_122_2: "fix-122-2",

  // Кладовая уборочного инвентаря (123)

  FIX_123_1: "fix-123-1",

  // Коридор столовая (124)

  FIX_124_1: "fix-124-1",
  FIX_124_2: "fix-124-2",

  // Столовая  (125)
  FIX_125_1: "fix-125-1",
  FIX_125_2: "fix-125-2",
  FIX_125_3: "fix-125-3",
  FIX_125_4: "fix-125-4",
  FIX_125_5: "fix-125-5",

  // Столовая зал  (126)

  FIX_126_1: "fix-126-1",
  FIX_126_2: "fix-126-2",

  // Подвал  (127)
  FIX_127_1: "fix-127-1",
  FIX_127_2: "fix-127-2",
} as const;

export type ElectricalPointId =
  (typeof ELECTRICAL_POINT_IDS_1_FLOOR)[keyof typeof ELECTRICAL_POINT_IDS_1_FLOOR];

export type RoomId = (typeof ROOM_IDS_1_FLOOR)[keyof typeof ROOM_IDS_1_FLOOR];
