export const ROOM_IDS_3_FLOOR = {
  CORRIDOR: "room-3-301", // Коридор
  ECONOMIST: "room-3-302", // Экономист
  OCCUPATIONAL_SAFETY: "room-3-303", // Охрана труда
  ACCOUNTING: "room-3-304", // Бухгалтерия
  CHIEF_ENGINEER: "room-3-306", // Главный инженер
  RECEPTION: "room-3-307", // Приемная
  PAYROLL: "room-3-308", // Бухгалтерия (расчет)
  MEETING_ROOM: "room-3-310", // Селекторная
  PROGRAMMER: "room-3-312", // Инженер Программист
  HR_DEPARTMENT: "room-3-313", // Специалист по кадрам
  DIRECTOR: "room-3-314", // Начальник
  TOILET_MEN: "room-3-315", // Мужской туалет
  TOILET_WOMEN: "room-3-316", // Женский туалет
  WORK_ECONOMIST: "room-3-317", // Экономист по труду это ксерокс
  MASS_WORK_SPECIALIST: "room-3-318", // Специалист по организационно массовой работе
  ACCOUNTING_CONTROL_GROUP_LEAD: "room-3-319", // Руководитель учетно-контрольной группы
} as const;

export const ELECTRICAL_POINT_IDS_3_FLOOR = {
  // Розетки

  // Экономист (302)
  OUT_302_1: "out-302-1",
  OUT_302_2: "out-302-2",
  OUT_302_3: "out-302-3",

  // Охрана труда (303)
  OUT_303_1: "out-303-1",
  OUT_303_2: "out-303-2",

  // Бухгалтерия (304)
  OUT_304_1: "out-304-1",
  OUT_304_2: "out-304-2",
  OUT_304_3: "out-304-3",
  OUT_304_4: "out-304-4",

  // Главный инженер (306)

  OUT_306_1: "out-306-1",
  OUT_306_2: "out-306-2",
  OUT_306_3: "out-306-3",

  // Бухгалтерия (расчет)(308)

  OUT_308_1: "out-308-1",
  OUT_308_2: "out-308-2",

  // Селекторная (310)
  OUT_310_1: "out-310-1",
  OUT_310_2: "out-310-2",

  // Инженер Программист(312)

  OUT_312_1: "out-312-1",
  OUT_312_2: "out-312-2",

  // Специалист по кадрам (313)

  OUT_313_1: "out-313-1",
  OUT_313_2: "out-313-2",

  // Начальник (314)

  OUT_314_1: "out-314-1",
  OUT_314_2: "out-314-2",
  OUT_314_3: "out-314-3",
  OUT_314_4: "out-314-4",

  // Мужской туалет (315)
  OUT_315_1: "out-315-1",
  OUT_315_2: "out-315-2",

  // Женский туалет (316)
  OUT_316_1: "out-316-1",
  OUT_316_2: "out-316-2",

  // Экономист по труду (317)
  OUT_317_1: "out-317-1",

  // Специалист по организационно массовой работе (318)
  OUT_318_1: "out-318-1",

  // Руководитель учетно-контрольной группы (319)
  OUT_319_1: "out-319-1",
  // Освещение

  // Коридор (301)
  FIX_301_1: "fix-301-1",
  FIX_301_2: "fix-301-2",
  FIX_301_3: "fix-301-3",
  FIX_301_4: "fix-301-4",
  FIX_301_5: "fix-301-5",
  FIX_301_6: "fix-301-6",

  // Экономист по труду (302)
  FIX_302_1: "fix-302-1",
  FIX_302_2: "fix-302-2",

  // Охрана труда (303)
  FIX_303_1: "fix-303-1",
  FIX_303_2: "fix-303-2",

  // Бухгалтерия (304)
  FIX_304_1: "fix-304-1",
  FIX_304_2: "fix-304-2",
  FIX_304_3: "fix-304-3",

  // Главный инженер (306)
  FIX_306_1: "fix-306-1",
  FIX_306_2: "fix-306-2",

  // Приемная (307)
  FIX_307_1: "fix-307-1",
  FIX_307_2: "fix-307-2",

  // Бухгалтерия (расчет)(308)
  FIX_308_1: "fix-308-1",
  FIX_308_2: "fix-308-2",

  // Комната отдыха (309)
  FIX_309_1: "fix-309-1",
  FIX_309_2: "fix-309-2",

  // Селекторная (310)
  FIX_310_1: "fix-310-1",
  FIX_310_2: "fix-310-2",
  FIX_310_3: "fix-310-3",

  // Инженер Программист(312)
  FIX_312_1: "fix-312-1",
  FIX_312_2: "fix-312-2",

  //  Специалист по кадрам(313)
  FIX_313_1: "fix-313-1",
  FIX_313_2: "fix-313-2",
  FIX_313_3: "fix-313-3",

  // Начальник (314)

  FIX_314_1: "fix-314-1",
  FIX_314_2: "fix-314-2",
  FIX_314_3: "fix-314-3",

  // Мужской туалет (315)
  FIX_315_1: "fix-315-1",
  FIX_315_2: "fix-315-2",
  FIX_315_3: "fix-315-3",

  // Женский туалет (316)

  FIX_316_1: "fix-316-1",
  FIX_316_2: "fix-316-2",
  FIX_316_3: "fix-316-3",

  // Экономист по труду (317)
  FIX_317_1: "fix-317-1",
  FIX_317_2: "fix-317-2",
  // Специалист по организационно массовой работе (318)

  FIX_318_1: "fix-318-1",
  FIX_318_2: "fix-318-2",

  // Руководитель учетно-контрольной группы (319)
  FIX_319_1: "fix-319-1",
  FIX_319_2: "fix-319-2",
} as const;
